veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_OFF (7u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_OFF (23u)

