veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_RX_MULTICAST_PACKETS_GOOD_Bits.RXMCASTG */
#define IFX_GETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_MULTICAST_PACKETS_GOOD_Bits.RXMCASTG */
#define IFX_GETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_CRC_ERROR_PACKETS_Bits.RXCRCERR */
#define IFX_GETH_RX_CRC_ERROR_PACKETS_RXCRCERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_CRC_ERROR_PACKETS_Bits.RXCRCERR */
#define IFX_GETH_RX_CRC_ERROR_PACKETS_RXCRCERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_CRC_ERROR_PACKETS_Bits.RXCRCERR */
#define IFX_GETH_RX_CRC_ERROR_PACKETS_RXCRCERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_ALIGNMENT_ERROR_PACKETS_Bits.RXALGNERR */
#define IFX_GETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_ALIGNMENT_ERROR_PACKETS_Bits.RXALGNERR */
#define IFX_GETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_ALIGNMENT_ERROR_PACKETS_Bits.RXALGNERR */
#define IFX_GETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_RUNT_ERROR_PACKETS_Bits.RXRUNTERR */
#define IFX_GETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_RUNT_ERROR_PACKETS_Bits.RXRUNTERR */
#define IFX_GETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_RUNT_ERROR_PACKETS_Bits.RXRUNTERR */
#define IFX_GETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_JABBER_ERROR_PACKETS_Bits.RXJABERR */
#define IFX_GETH_RX_JABBER_ERROR_PACKETS_RXJABERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_JABBER_ERROR_PACKETS_Bits.RXJABERR */
#define IFX_GETH_RX_JABBER_ERROR_PACKETS_RXJABERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_JABBER_ERROR_PACKETS_Bits.RXJABERR */
#define IFX_GETH_RX_JABBER_ERROR_PACKETS_RXJABERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_UNDERSIZE_PACKETS_GOOD_Bits.RXUNDERSZG */
#define IFX_GETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_UNDERSIZE_PACKETS_GOOD_Bits.RXUNDERSZG */
#define IFX_GETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_UNDERSIZE_PACKETS_GOOD_Bits.RXUNDERSZG */
#define IFX_GETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_OVERSIZE_PACKETS_GOOD_Bits.RXOVERSZG */
#define IFX_GETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_OVERSIZE_PACKETS_GOOD_Bits.RXOVERSZG */
#define IFX_GETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_OVERSIZE_PACKETS_GOOD_Bits.RXOVERSZG */
#define IFX_GETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_GETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_GETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_GETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_GETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_GETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_GETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_UNICAST_PACKETS_GOOD_Bits.RXUCASTG */
#define IFX_GETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_UNICAST_PACKETS_GOOD_Bits.RXUCASTG */
#define IFX_GETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_UNICAST_PACKETS_GOOD_Bits.RXUCASTG */
#define IFX_GETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_LENGTH_ERROR_PACKETS_Bits.RXLENERR */
#define IFX_GETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_LENGTH_ERROR_PACKETS_Bits.RXLENERR */
#define IFX_GETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_MSK (0xffffu)

