veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENMACADDR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENMACADDR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENMACADDR_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.CSC */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_CSC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.CSC */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_CSC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.CSC */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_CSC_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TXTSSTSM */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TXTSSTSM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TXTSSTSM */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TXTSSTSM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TXTSSTSM */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TXTSSTSM_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.AV8021ASMEN */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.AV8021ASMEN */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.AV8021ASMEN */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SNSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SNSINC_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SNSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SNSINC_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SNSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SNSINC_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SSINC_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SSINC_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_GETH_MAC_SUB_SECOND_INCREMENT_SSINC_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_TSS_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_TSS_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_TSS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_LEN (31u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MSK (0x7fffffffu)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_LEN (31u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MSK (0x7fffffffu)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_GETH_MAC_TIMESTAMP_ADDEND_TSAR_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_GETH_MAC_TIMESTAMP_ADDEND_TSAR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_GETH_MAC_TIMESTAMP_ADDEND_TSAR_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSSOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSSOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSSOVF_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT0_OFF (1u)

